[
  {
    "number": "01",
    "img": "/images/booki_project_cover.jpg",
    "date": "1669935600000",
    "name": "booki",
    "resume": "Projet issu de la formation OpenClassrooms consistant à réaliser une page d'accueil d'agence de voyage.",
    "description": "Ce projet consistait à réaliser une page d'accueil d'agence de voyage. Les notions d'accessibilité et d'adaptabilité d'une page web à travers le responsive design sont au coeur de ce projet. La maîtrise du CSS et notamment l'usage de la méthode 'Flexbox', permettant de distribuer l'espace entre les éléments d'une interface ainsi que de les aligner, ont permis de répondre à ces enjeux.",
    "type": "frontend",
    "demoUrl": "https://geoffreycoste.github.io/ocr_booki/",
    "codeUrl": "https://github.com/GeoffreyCoste/ocr_booki",
    "badges": ["HTML", "CSS"]
  },
  {
    "number": "02",
    "img": "/images/kasa_project_cover.jpg",
    "date": "1678057200000",
    "name": "kasa",
    "resume": "Projet issu de la formation OpenClassrooms consistant à réaliser une application web de location immobilière. ",
    "description": "Ce projet consistait à réaliser une application web de location immobilière. Le projet met en avant le concept de Single Page Application (SPA) et l'intérêt d'une interface utilisateur intéractive, comportant différents états et de manipuler des données. La division de la page en composants, le recours à la syntaxe JSX et aux outils mis à disposition par le Framework React, ont permis de développer une interface de qualité.",
    "type": "frontend",
    "demoUrl": "https://geoffreycoste.github.io/ocr_kasa/",
    "codeUrl": "https://github.com/GeoffreyCoste/ocr_kasa",
    "badges": ["react", "react-router", "sass"]
  },
  {
    "number": "03",
    "img": "/images/sophie_bluel_project_cover.png",
    "date": "1672863460000",
    "name": "Sophie Bluel",
    "resume": "Projet issu de la formation OpenClassrooms consistant à créer une page web dynamique avec JavaScript.",
    "description": "Ce projet consistait à créer une page web dynamique. Ainsi, il s'agissait d'assurer une mise à jour du contenu de la page en fonction d'informations susceptibles de varier au moment de sa consultation. Le langage de programmation JavaScript en tant que partie essentielle d'une application web intéractive est ici mis en lumière (opérations CRUD, manipulation du DOM, gestion d'événements ...).",
    "type": "frontend",
    "demoUrl": "https://ocr-portfolio-archi-frontend.vercel.app/index.html",
    "codeUrl": "https://github.com/GeoffreyCoste/ocr_portfolio_archi",
    "badges": ["HTML", "CSS", "JavaScript"]
  }
]
